app/controllers/workflow_controller.rb

  def run
    step_id = params[:id]
    @step = WorkflowStep.find_by_id(step_id)
---
SELECT * FROM "workflow_steps" WHERE ("workflow_steps"."id" = '2') LIMIT 1

  def invoke

    workflow_name = params[:workflow_name]
    workflow_instance_id = params[:workflow_instance_id]
    engine = global_engine
    workflow_definition = engine.get_workflow_definitions(workflow_name)

    document_cls = workflow_definition.document_cls
    if workflow_instance_id == "new"

      begin
        if document_cls.is_a? String
          document = Object.const_get(document_cls).new(params[:document])
          document.save!
          #puts params[:workflow_transition]
          #puts document.class
          #puts workflow_definition.inspect
          workflow_definition.start(params[:workflow_transition], document)


        end
      rescue Exception => e
        puts e.message
        puts e.backtrace.join("\n")
---
SELECT * FROM "workflow_definitions" WHERE (name = '收文') LIMIT 1

  def transit
    step = WorkflowStep.find(params[:workflow_step_id])
---
SELECT * FROM "workflow_steps" WHERE (workflow_instance_id = 2 and workflow_step_definition_id = 5 )